Repository: mohamed-emad-c4/yt_to_todo
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: All Playlists
ar: جميع قوائم التشغيل

source: All Videos
ar: جميع الفيديوهات

source: Add Playlist
ar: إضافة قائمة تشغيل

source: Total Time
ar: الوقت

source: Total Videos
ar: الفيديوهات

source: Insert
ar: إدراج

source: Delete
ar: حذف

source: View Playlist
ar: عرض قائمة التشغيل

source: View Playlist Roadmap
ar: عرض خريطة قائمة التشغيل

source: Duration
ar: المدة

source: The Playlist Roadmap
ar: خريطة قائمة التشغيل

source: Video
ar: فيديو

source: Title
ar: العنوان

source: No playlists found
ar: لم يتم العثور على قوائم تشغيل

source: Enter any notes about the playlist
ar: أدخل أي ملاحظات عن قائمة التشغيل

source: Notes
ar: ملاحظات

source: Enter the URL of the playlist
ar: أدخل عنوان URL لقائمة التشغيل

source: Please enter a URL
ar: يرجى إدخال عنوان URL

source: error
ar: خطأ

source: Invalid playlist URL
ar: عنوان URL لقائمة التشغيل غير صالح

source: URL
ar: عنوان URL

source: Please enter a valid YouTube playlist URL
ar: يرجى ادخال عنوان URL لقوائمة التشغيل مصرفي

source: Playlist URL
ar: عنوان URL لقائمة التشغيل

source: Playlist Notes
ar: ملاحظات لقائمة التشغيل

source: Something went wrong
ar: حدث خطأ

source: All Days Roadmap
ar: خريطة كل الايام

source: Loading...
ar: تحميل...

source: No videos found
ar: لم يتم العثور على فيديوهات

source: Could not launch
ar: لا يمكن تشغيل

source: About Us
ar: من نحن

# WelcomeMessage
source: Welcome to our app! We are dedicated to providing you with the best service and experience. Our team is committed to continuous improvement and innovation to meet your needs.
ar: مرحبًا بك في تطبيقنا! نحن ملتزمون بتقديم أفضل خدمة وتجربة. فريقنا يسعى دائماً للتحسين المستمر والابتكار لتلبية احتياجاتك.

# OurMission
source: Our mission is to deliver high-quality solutions that improve your daily life and provide a seamless user experience.
ar: مهمتنا هي تقديم حلول عالية الجودة لتحسين حياتك اليومية وتوفير تجربة مستخدم سلسة.

source: Contact Us
ar: اتصل بنا

# QuestionsFeedback
source: If you have any questions, feedback, or just want to get in touch, feel free to contact us.
ar: إذا كان لديك أي استفسارات أو ملاحظات أو ترغب في التواصل معنا، فلا تتردد في الاتصال بنا.

source: Email Us
ar: راسلنا عبر البريد الإلكتروني

# FollowUs
source: Follow us on social media:
ar: تابعنا على وسائل التواصل الاجتماعي:

source: Facebook
ar: فيسبوك

source: Twitter
ar: تويتر

source: Instagram
ar: إنستغرام

source: Could not launch
ar: تعذر الفتح

source: Help & Support
ar: المساعدة والدعم

# WeAreHereToHelp
source: We are here to help! Whether you have a question, encounter an issue, or need further assistance, our support team is ready to assist you.
ar: نحن هنا للمساعدة! سواء كان لديك سؤال أو واجهت مشكلة أو تحتاج إلى مساعدة إضافية، فريق الدعم لدينا جاهز لمساعدتك.

source: FAQ
ar: الأسئلة الشائعة:

# ResetPassword
source: How can I reset my password?
ar: كيف يمكنني إعادة تعيين كلمة المرور الخاصة بي؟

# ChangeEmail
source: How to change my email address?
ar: كيف أغير عنوان البريد الإلكتروني الخاص بي؟

# ContactSupport
source: How to contact customer support?
ar: كيف أتواصل مع دعم العملاء؟

# DidntFindAnswer
source: If you didn't find the answer you're looking for, feel free to contact us directly:
ar: إذا لم تجد الإجابة التي تبحث عنها، لا تتردد في الاتصال بنا مباشرة:

# ConnectWithUs
source: Connect with us on social media:
ar: تواصل معنا على وسائل التواصل الاجتماعي:

source: WhatsApp
ar: واتساب

source: Messenger
ar: ماسنجر

# WeAppreciateFeedback
source: We appreciate your feedback and strive to improve our service continuously.
ar: نحن نقدر ملاحظاتك ونسعى لتحسين خدمتنا باستمرار.

source: Privacy and Security
ar: الخصوصية والأمان

# YourPrivacyAndSecurity
source: Your privacy and security are important to us. We take the following measures to ensure that your data is protected:
ar: خصوصيتك وأمانك مهمان بالنسبة لنا. نتخذ الإجراءات التالية لضمان حماية بياناتك:

# DataEncryption
source: Data Encryption: We use industry-standard encryption to protect your data.
ar: تشفير البيانات: نستخدم التشفير المعتمد لحماية بياناتك.

# AccessControl
source: Access Control: No personnel can access your data.
ar: التحكم في الوصول: لا يمكن لأي شخص الوصول إلى بياناتك.

# RegularAudits
source: Regular Audits: We conduct regular security audits to identify and fix vulnerabilities.
ar: المراجعات الدورية: نقوم بإجراء مراجعات أمنية دورية لتحديد وإصلاح الثغرات.

# UserControl
source: User Control: You have control over your data and can manage your settings at any time.
ar: تحكم المستخدم: لديك التحكم الكامل في بياناتك ويمكنك إدارة إعداداتك في أي وقت.

# PIN
source: PIN: We use PIN codes to protect your notes and ensure that only you can access them.
ar: الرمز السري: نستخدم الرموز السرية لحماية ملاحظاتك والتأكد من أنه لا يمكن لأحد الوصول إليها غيرك.

# ForAnyQuestions
source: For any questions or concerns, please contact our support team.
ar: لأي استفسارات أو مخاوف، يرجى الاتصال بفريق الدعم الخاص بنا.

source: Dark Mode
ar: الوضع الليلي

source: Language
ar: اللغة

source: Enable Notifications
ar: تمكين الإشعارات

source: Close
ar: إغلاق

source: English
ar: الانجليزية

source: Arabic
ar: العربية

source: Theme
ar: الثيم

source: Dark Mode
ar: الوضع الليلي

source: Light Mode
ar: الوضع النهاري

# q1
source: Q: Why does it take a long time to load data in the app?
ar: س: لماذا يستغرق تحميل البيانات في التطبيق وقتًا طويلاً؟

# a_q1
source: A: There can be several factors contributing to data loading delays, including:
ar: ج: قد تكون هناك عدة عوامل تسهم في تأخير تحميل البيانات، بما في ذلك:

# a1_q1
source: A: We are continuously working to improve the app's performance to reduce loading times. Thank you for your understanding!
ar: ج: نحن نعمل باستمرار على تحسين أداء التطبيق لتقليل أوقات التحميل. شكرًا لتفهمكم!

# a2_q1
source: A:Internet Connection: Ensure that your internet connection is stable and fast.
ar: ج:اتصال الإنترنت: تأكد من أن اتصالك بالإنترنت مستقر وسريع.

# a3_q1
source: A:Data Size: Loading large amounts of data may take longer.
ar: ج:حجم البيانات: تحميل كميات كبيرة من البيانات قد يستغرق وقتًا أطول.

# a4_q1
source: A:Server Performance: Sometimes, there may be delays from the server hosting the data.
ar: ج:أداء الخادم: أحيانًا قد يكون هناك تأخير من الخادم الذي يستضيف البيانات.

# a5_q1
source: A:App Updates: Updates or maintenance may temporarily slow down the app.
ar: تحديثات التطبيق: قد تؤدي التحديثات أو الصيانة إلى بطء مؤقت في التطبيق.

# q2
source: Q: How can I add a YouTube playlist?
ar: س: كيف يمكنني إضافة قائمة تشغيل يوتيوب؟

# a1_q2
source: A: You can add a YouTube playlist by entering the playlist link into the app. The app will analyze the link and retrieve all the videos within it.
ar: ج: يمكنك إضافة قائمة تشغيل يوتيوب عن طريق إدخال رابط قائمة التشغيل في التطبيق. سيتم تحليل الرابط واسترداد جميع الفيديوهات الموجودة فيه.

# q3
source: Q: What does the app display after adding a playlist?
ar: س: ماذا يعرض التطبيق بعد إضافة قائمة التشغيل؟

# a1_q3
source: A: After adding the playlist, the app will display all the videos contained within it, along with the duration of each video and the total duration of all videos.
ar: ج: بعد إضافة قائمة التشغيل، سيعرض التطبيق جميع الفيديوهات الموجودة فيها، بالإضافة إلى مدة كل فيديو وإجمالي مدة جميع الفيديوهات.

# q4
source: Q: What is the roadmap that is created?
ar: س: ما هو الـ roadmap الذي يتم إنشاؤه؟

# a1_q4
source: A: The roadmap is a suggested timeline for watching the videos based on the duration you specify. You can set the amount of time you want to dedicate to watching the videos, and the app will provide a plan for you to follow.
ar: ج: الـ roadmap هو جدول زمني مقترح لمشاهدة الفيديوهات بناءً على المدة التي تحددها. يمكنك تحديد المدة الزمنية التي ترغب في تخصيصها لمشاهدة الفيديوهات، وسيوفر لك التطبيق خطة لمتابعتها.

# q5
source: Q: Can I modify the durations of the videos in the roadmap?
ar: س: هل يمكنني تعديل مدة الفيديوهات في الـ roadmap؟

# a1_q5
source: A: Currently, you cannot modify the durations of the videos in the roadmap, but you can choose a different duration when setting up the roadmap for a different plan.
ar: ج: حاليًا، لا يمكن تعديل مدة الفيديوهات في الـ roadmap، لكن يمكنك اختيار مدة مختلفة عند إعداد الـ roadmap للحصول على تخطيط مختلف.

# q6
source: Q: Does the app work with all YouTube playlists?
ar: س: هل يعمل التطبيق مع جميع قوائم تشغيل يوتيوب؟

# a1_q6
source: A: Yes, the app works with any public YouTube playlist. Just make sure to enter the correct link for the playlist.
ar: ج: نعم، يعمل التطبيق مع أي قائمة تشغيل يوتيوب عامة. تأكد من إدخال الرابط الصحيح للقائمة.
